#9.1.2. Дано множество A = { a, b, c, d, e, f, g, h, j, k}. Сколько существует способов
#разбить его на 5 именованных множеств?

print(pow(10,5))